python/introduction_2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-27 Sat 14:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction to Python II</title>
<meta name="author" content="Coach Jesse" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content">
<h1 class="title">Introduction to Python II</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8c1f420">1. About this course</a></li>
<li><a href="#orgbf39eae">2. What you&rsquo;ll learn</a></li>
<li><a href="#org80d3de6">3. Schedule</a>
<ul>
<li><a href="#org9b07723">3.1. Week 1</a></li>
<li><a href="#orge12be17">3.2. Week 2</a></li>
<li><a href="#org331a060">3.3. Week 3</a></li>
<li><a href="#orgfdccb9d">3.4. Week 4</a></li>
<li><a href="#orgd0003d1">3.5. Week 5</a></li>
<li><a href="#orgef0d0e3">3.6. Week 6</a></li>
<li><a href="#orgeb6c757">3.7. Week 7</a></li>
<li><a href="#orgac65bad">3.8. Week 8</a></li>
<li><a href="#orgae8ba87">3.9. Week 9</a></li>
<li><a href="#orgef47b49">3.10. Week 10</a></li>
<li><a href="#orga980665">3.11. Week 11</a></li>
<li><a href="#org7f99bc3">3.12. Week 12</a></li>
</ul>
</li>
<li><a href="#orged61aed">4. Prerequisites (soft)</a></li>
<li><a href="#orgf464206">5. Specification</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8c1f420" class="outline-2">
<h2 id="org8c1f420"><span class="section-number-2">1</span> About this course</h2>
<div class="outline-text-2" id="text-1">
<p>
This course is for students with some Python programming experience at beginner level, covering the basics of how a computer interprets lines of code; how to write programs, evaluate their output, and revise the code; how to work with variables and their changing values; how to use built-in data types and functions
</p>

<p>
This course also covers some special and advanced features of Python programming language. For example, higher order and lambda functions, unpacking and asterisk operators, keyword arguments and comprehensions. This course also introduces the basic object-oriented programming concepts, classes and objects in Python.
</p>

<p>
Structurally, the course is comprised of several parts. Instruction is delivered via online video meeting. During the class, students will work on both multiple choice questions and coding problems. In between video meetings, students will work on programming puzzles closely related to knowledge taught in current week&rsquo;s class. Students will also complete several mini coding projects that are split into weeks.
</p>

<p>
By the end of this course, you&rsquo;ll be able to write small programs in Python that use variables, mathematical and logical operators, functions and classes. Once a student completes this course, they will be ready to take more advanced programming courses, such as Intermediate Computer Programming I.
</p>
</div>
</div>


<div id="outline-container-orgbf39eae" class="outline-2">
<h2 id="orgbf39eae"><span class="section-number-2">2</span> What you&rsquo;ll learn</h2>
</div>


<div id="outline-container-org80d3de6" class="outline-2">
<h2 id="org80d3de6"><span class="section-number-2">3</span> Schedule</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org9b07723" class="outline-3">
<h3 id="org9b07723"><span class="section-number-3">3.1</span> Week 1</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Course set up. Introduction to repl.it and Python runtime environment. How to install Python packages and play in IPython. Review skills learned in Introduction 1: variables, types, conditions, loops.
</p>
<ul class="org-ul">
<li>Homework: programming puzzles.</li>
<li>Project 1 part1.</li>
</ul>
</div>
</div>

<div id="outline-container-orge12be17" class="outline-3">
<h3 id="orge12be17"><span class="section-number-3">3.2</span> Week 2</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The fundamentals of how computers work. What is a program? What is program code, and how program is executed in computers. Basics of computer architecture and networks. How different types of numbers and data are storage in memory.
</p>
<ul class="org-ul">
<li>Homework: programming puzzles.</li>
<li>Project 1 part 2.</li>
</ul>
</div>
</div>

<div id="outline-container-org331a060" class="outline-3">
<h3 id="org331a060"><span class="section-number-3">3.3</span> Week 3</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Built-in data types and functions. list, tuple, string, dictionary, set: their properties and advanced operations.
</p>
<ul class="org-ul">
<li>Homework: programming puzzles</li>
<li>Project 2 part 1.</li>
</ul>
</div>
</div>

<div id="outline-container-orgfdccb9d" class="outline-3">
<h3 id="orgfdccb9d"><span class="section-number-3">3.4</span> Week 4</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Function definition and structure review. Mathematical Operators. Adding addition, subtraction, multiplication, division, modulus, and exponents to your code, and seeing how they work with unexpected data types. Introduce the concept of operator as a function. Common functions: abs, int, bool, dir, input, len, max, min, sum, range, random numbers.
</p>
<ul class="org-ul">
<li>Homework: programming puzzles</li>
<li>Project 2 part 2.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd0003d1" class="outline-3">
<h3 id="orgd0003d1"><span class="section-number-3">3.5</span> Week 5</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Procedural Programming. The fundamental approach to program code: writing sequences of lines of code that run in order to accomplish an objective. How to continue and break loops. How to raise and catch exceptions. The advanced try-else-except-finally structure.
</p>
<ul class="org-ul">
<li>Homework: programming puzzles</li>
<li>Project 3 part 1.</li>
</ul>
</div>
</div>

<div id="outline-container-orgef0d0e3" class="outline-3">
<h3 id="orgef0d0e3"><span class="section-number-3">3.6</span> Week 6</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Variables, names, scopes, files organization, modules and packages. Creating and modifying variables, tracing how their values may change as a program runs, and understanding the role of scopes, modules and packages.
</p>
<ul class="org-ul">
<li>Homework: programming puzzles.</li>
<li>Project 3 part 2.</li>
</ul>
</div>
</div>

<div id="outline-container-orgeb6c757" class="outline-3">
<h3 id="orgeb6c757"><span class="section-number-3">3.7</span> Week 7</h3>
<div class="outline-text-3" id="text-3-7">
<p>
Comprehensions: list comprehension, set comprehension and dictionary comprehension. What is a comprehension and how to use it. Review of Project 3.
</p>
<ul class="org-ul">
<li>Homework: programming puzzles.</li>
<li>Project 4 part 1.</li>
</ul>
</div>
</div>

<div id="outline-container-orgac65bad" class="outline-3">
<h3 id="orgac65bad"><span class="section-number-3">3.8</span> Week 8</h3>
<div class="outline-text-3" id="text-3-8">
<p>
Functions and code reuse: DRY, higher-order function, lambda function.
</p>
<ul class="org-ul">
<li>Homework: programming puzzles.</li>
<li>Project 4 part 2.</li>
</ul>
</div>
</div>

<div id="outline-container-orgae8ba87" class="outline-3">
<h3 id="orgae8ba87"><span class="section-number-3">3.9</span> Week 9</h3>
<div class="outline-text-3" id="text-3-9">
<p>
Special operations: unpacking, the asterisk operator: *  and **, function arguments. Review of Project 4.
</p>
<ul class="org-ul">
<li>Homework: programming puzzles.</li>
<li>Project 5 part 1.</li>
</ul>
</div>
</div>

<div id="outline-container-orgef47b49" class="outline-3">
<h3 id="orgef47b49"><span class="section-number-3">3.10</span> Week 10</h3>
<div class="outline-text-3" id="text-3-10">
<p>
Objected-oriented programming 1: Class and objects, data abstraction. Attributes and methods. Python class definition and initialization.
</p>
<ul class="org-ul">
<li>Homework: programming puzzles.</li>
<li>Project 5 part 2.</li>
</ul>
</div>
</div>

<div id="outline-container-orga980665" class="outline-3">
<h3 id="orga980665"><span class="section-number-3">3.11</span> Week 11</h3>
<div class="outline-text-3" id="text-3-11">
<p>
Objected-oriented programming 2: Inheritance and composition.
</p>
<ul class="org-ul">
<li>Homework: programming puzzles.</li>
<li>Project 5 part 3.</li>
</ul>
</div>
</div>

<div id="outline-container-org7f99bc3" class="outline-3">
<h3 id="org7f99bc3"><span class="section-number-3">3.12</span> Week 12</h3>
<div class="outline-text-3" id="text-3-12">
<p>
Objected-oriented programming 3: Composition. Review project 5.
</p>
<ul class="org-ul">
<li>Homework: programming puzzles.</li>
</ul>
</div>
</div>
</div>



<div id="outline-container-orged61aed" class="outline-2">
<h2 id="orged61aed"><span class="section-number-2">4</span> Prerequisites (soft)</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>Interests in computer programming.</li>
<li>Elementary school math: arithmetic operations, shapes, speed, etc.</li>
<li>Basic experience in Python programming. Taking Introduction to Python I course would be perfect.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf464206" class="outline-2">
<h2 id="orgf464206"><span class="section-number-2">5</span> Specification</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Length: 12 weeks</li>
<li>Effort: 2-4 hours per week</li>
<li>Level: Advanced Introduction</li>
<li>Language: English</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Coach Jesse</p>
<p class="date">Created: 2021-03-27 Sat 14:14</p>
</div>
</body>
</html>
